app/views/parties/index.html.erb

SELECT "foods".* FROM "foods" INNER JOIN "orders" ON "foods"."id" = "orders"."food_id" WHERE "orders"."party_id" = $1  [["party_id", 1]]
SELECT "parties".* FROM "parties"
---

 <h4> Food Order: <span class="party-stats"><% party.foods.each do |food| %>