app/views/parties/show.html.erb

<span class="food-form"><%= f.label :food %></span>
  <%= f.collection_select :food_id, Food.all, :id, :name, class:"custom-dropdown" %>
---
SELECT "foods".* FROM "foods"