app/controllers/orders_controller.rb

def create
  order = Order.create!(order_params)
---
INSERT INTO "orders" ("user_id", "party_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["party_id", 1], ["food_id", 1], ["created_at", "2016-04-25 13:02:39.778041"], ["updated_at", "2016-04-25 13:02:39.778041"]]