app/controllers/parties_controller.rb

  def index
    @parties = Party.all
---
SELECT "parties".* FROM "parties"

  def show
    @party = Party.find params[:id]
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    party = Party.create party_params
---
INSERT INTO "parties" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2016-04-24 17:42:28.924790"], ["updated_at", "2016-04-24 17:42:28.924790"]]

  def edit
    @party = Party.find params[:id]
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    party = Party.find params[:id]
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    party = Party.find params[:id]
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]