app/controllers/users_controller.rb

def create
  User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "liz"], ["password_digest", "$2a$10$9x3ondiBK98zGcWoNmV69.AU/kJNwOdyl3ORiE678PTVAP2ZlJRxe"], ["created_at", "2016-04-23 21:08:42.486723"], ["updated_at", "2016-04-23 21:08:42.486723"]]